trade_exp/src/DataProcessors/КПП2/КПП2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КПП2</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/СостояниеОтгрузкиДокумента/СостояниеОтгрузкиДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f6e2a290-cbc8-4936-bbb2-90e8d1c0db51">
  <name>СостояниеОтгрузкиДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="dffce7aa-5f60-4a23-8318-5410c67632ff">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1cc5b099-9bfb-4b1e-8a24-a86abbfec9a4">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4a9099ca-f5d8-4382-a001-2e51e75cdaa1">
    <name>ОценкаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="46ae374e-4820-4eae-9365-1ccc6b8c5430">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d745fd3-8b9f-420d-a661-da3ab7a348d2">
    <name>НомерЗаезда</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="c260e72d-b1f0-4145-ad5d-b7ddd7768010">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f50361ea-5ef2-4f47-b334-48a3a4671d38">
    <name>Филиал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/УчетРабочегоВремениСотрудников/УчетРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="13d75dc0-9223-4b1b-beb4-cba8132abe50">
  <name>УчетРабочегоВремениСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="a44913b0-4063-4968-bf34-b77f64254b83">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="54b7c3ee-5669-4057-b209-a361d67c8bad">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0d926621-4d7d-40ed-8fec-80d57c83437a">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="58649832-c538-4ecf-98e0-7df52cfc2105">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыЗаказовПоставщикам/СтатусыЗаказовПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЗаказовПоставщикам</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6c6ec02e-3ed2-4a05-a55f-81415ba33bc2">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыВодителей/СтатусыВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80675a86-f1b3-42aa-bbed-b443ea3fba8a">
  <name>СтатусыВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="24cec108-8195-4aad-a265-e2495c813871">
    <name>Готов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="25759240-bbde-4bc4-8a69-610103245566">
    <name>ВРейсе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8b61fd48-1b3f-434a-9f2d-7e7107b62b28">
    <name>НеГотов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7423ebb7-3eff-4d31-ba72-320c2bd8592c">
    <name>Возвращается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СостоянияОтгрузкиДокумента/СостоянияОтгрузкиДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4aae44bd-66b0-4e44-a260-c24e6ec64d86">
  <name>СостоянияОтгрузкиДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8e84c8e8-e768-4147-96fc-6d48a0109758">
    <name>ВОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="819c0e3a-7dc1-4053-bee0-2c94c94a81a1">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7cd0e61f-5363-4ced-bdbb-463d617df349">
    <name>Выехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="78b7332e-7f20-463b-b919-4c9896d784b6">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СостоянияСотрудников/СостоянияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5c9d146-8f4a-45db-9b47-dc1f6c9559b2">
  <name>СостоянияСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b343c276-8ae6-43f0-b8dc-6404f67693a2">
    <name>Зашел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="33217620-5c33-4012-bc80-e5f910792d19">
    <name>Вышел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/КПП2/Forms/ФормаКПП/Module.bsl
#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	ВремяПоследнегоСканирования= ТекущаяДата();
	
	СтрукЦветаСтиля= ПолучитьЦвета();
	
	АдрессЗапрещено= ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Запрещено300.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
	АдрессРазрешено= ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Разрешено300.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
КонецПроцедуры

//СТАРТ
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	НадписьСообщения= "";
	Картинка= Неопределено;
	Элементы.Картинка.Обновить();
	Элементы.НадписьСообщения.ЦветТекста= СтрукЦветаСтиля.Красный;
	Элементы.НадписьСотрудник.Видимость= Ложь;
	Элементы.НадписьДокумент.Видимость= Ложь;
	Если Источник = "ПодключаемоеОборудование"  Тогда//Ввод доступен ставить не нужно, т.к. окно теряет фокус
		Если ИмяСобытия = "ScanData" Тогда
			Данные= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			Штрихкод= Данные.Штрихкод;
			
			Если ПустаяСтрока(Штрихкод) Тогда
				НадписьСообщения= "Не удалось прочитать штрихкод!";
				ПроигратьЗвук("fail");
				Возврат;
			КонецЕсли;
			
			
			Если Лев(Штрихкод, 4) = "8888" Тогда//Это сотрудник
				ЗарегистрироватьСотрудникаПоШтрихкоду(Штрихкод);
				
			Иначе//Это документ
				
				МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод);
				Если МассивСсылок.Количество() = 0 Тогда
					//Провереим не печать ли по секциям просканировали
					Ссылка= РСОбщийМодульВызовСервера.ПоискДокументаПоШК(Штрихкод);
					Если Не ЗначениеЗаполнено(Ссылка) Тогда
						НадписьСообщения = "Документ не найден";
						ЗафиксироватьОшибку(Неопределено, ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДокументНеНайден"), Штрихкод);
						Возврат;
					Иначе
						НадписьСообщения = "Просканировали печать по секциям";
						ЗафиксироватьОшибку(Ссылка, ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.СканировалиПечатьПоСекциям"), Штрихкод);
					КонецЕсли;
				Иначе
					Ссылка = МассивСсылок[0];
				КонецЕсли;
				
				НадписьДокумент= Ссылка;
				Элементы.НадписьДокумент.Видимость= Истина;
				
				Если ЭтоОшибочноеСканирование(Ссылка) Тогда
					ПодключитьОбработчикОжидания("НачальноеСостониеФормы", 2);
					Возврат;
				КонецЕсли;
				
				//Если есть рейс запускам все документы
				Рейс = ПолучитьРейс(Ссылка);
				Если ЗначениеЗаполнено(Рейс) Тогда
					ЗарегистрироватьСостояниеПоРейсу(Рейс, Штрихкод, Ложь);
					Возврат;
				Иначе
					Рейс = УправлениеДоступомСервер.ПолучитьРейсОтПоставщика(Ссылка);
					Если ЗначениеЗаполнено(Рейс) Тогда
						Для Каждого Заказ Из Рейс Цикл	
							ОбработатьДокументНаВъездВыезд(Заказ, Штрихкод, Ложь);
						КонецЦикла;
						Возврат;
					Иначе
						ОбработатьДокументНаВъездВыезд(Ссылка, Штрихкод);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РегистрацияВъездаВыезда
//ГЛАВНАЯ
&НаКлиенте
Процедура ОбработатьДокументНаВъездВыезд(Ссылка, Штрихкод="", ЭтоРейс=Ложь)
	ОтключитьОбработчикОжидания("НачальноеСостониеФормы");
	ПоследнийПросканированныйДокумент= Неопределено;
	
	Попытка
		//Если машина на складе регестрируем выезд без проверок
		Если МашинаНаСкладе(Ссылка) Тогда
			РегистрацияСостоянияВыезда(Ссылка, Штрихкод);
			Возврат;
		КонецЕсли;
		
		//Повторный заезд
		Если МашинаУжеВыезжала(Ссылка) Тогда
			Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ПовторныйЗаезд");
			ЗафиксироватьОшибку(Ссылка, Ошибка, Штрихкод);	
		КонецЕсли;
		
		//ОБРАБОТКА ДОКУМЕНТОВ			
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ОбработатьРеализацию(Ссылка, Штрихкод, ЭтоРейс);
			
		ИначеЕсли  ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
			ОбработатьЧек(Ссылка, Штрихкод, ЭтоРейс);

		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
			ОбработатьЗаказПоставщику(Ссылка, Штрихкод);
			
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда 
			ОбработатьПеремещение(Ссылка, Штрихкод);
			
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаданиеНаПеревозкуРейс") Тогда 
			ЗарегистрироватьСостояниеПоРейсу(Ссылка, Штрихкод, Истина);
			
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда 
			ОбработатьВозврат(Ссылка, Штрихкод);
			
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ОбработатьЗаказКлиента(Ссылка, Штрихкод);
			
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.БлокировкаДвиженияТоваров") Тогда
			ОбработатьБлокировку(Ссылка, Штрихкод);

		Иначе
			ОбработатьЛюбойДругой(Ссылка, Штрихкод);
		КонецЕсли;
		
	Исключение
		ПодключитьОбработчикОжидания("НачальноеСостониеФормы", 2);
	КонецПопытки;
	
	ПодключитьОбработчикОжидания("НачальноеСостониеФормы", 2);
КонецПроцедуры

//ОБРАБОТКА ДОКУМЕНТОВ
&НаКлиенте
Процедура ОбработатьРеализацию(Ссылка, Штрихкод, ЭтоРейс= Ложь)
	Ошибка= Неопределено; 
	
	Если Не ЭтоРейс Тогда
		Рейс= ПолучитьРейс(Ссылка);
		Если ЗначениеЗаполнено(Рейс) Тогда
			Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДолженСканироватсяМаршрутныйЛист");
		КонецЕсли;
	КонецЕсли;

	Если Не ДокументОплачен(Ссылка) Тогда
		Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДокументНеОплачен");
	ИначеЕсли ДокументОтгружен(Ссылка) Тогда
		Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДокументПолностьюОтгружен");
	КонецЕсли;
	
	Если Ошибка <> Неопределено Тогда
		ЗафиксироватьОшибку(Ссылка, Ошибка, Штрихкод);					
	КонецЕсли;
	
	РегистрацияСостоянияЗаезда(Ссылка, Штрихкод, Ошибка);
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьЧек(Ссылка, Штрихкод, ЭтоРейс= Ложь)
	Ошибка= Неопределено;
	
	Если Не ЭтоРейс Тогда
		Рейс= ПолучитьРейс(Ссылка);
		Если ЗначениеЗаполнено(Рейс) Тогда
			Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДолженСканироватсяМаршрутныйЛист");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЧекПробит(Ссылка) Тогда
		Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДокументНеОплачен");
	ИначеЕсли ДокументОтгружен(Ссылка) Тогда
		Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДокументПолностьюОтгружен");
	КонецЕсли;
	
	Если Ошибка <> Неопределено Тогда
		ЗафиксироватьОшибку(Ссылка, Ошибка, Штрихкод);					
	КонецЕсли;
	
	РегистрацияСостоянияЗаезда(Ссылка, Штрихкод, Ошибка);
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьЗаказПоставщику(Ссылка, Штрихкод)
	Ошибка= Неопределено;
	СтатусДокумента = ПолучитьСтатус(Ссылка);
	Если СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПоставщикам.НеСогласован") ИЛИ СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПоставщикам.Закрыт") Тогда
		Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.СтатусЗаказаНеКПоступлению");
	КонецЕсли;
	
	Если Ошибка <> Неопределено Тогда
		ЗафиксироватьОшибку(Ссылка, Ошибка, Штрихкод);					
	КонецЕсли;
	
	РегистрацияСостоянияЗаезда(Ссылка, Штрихкод, Ошибка);
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьПеремещение(Ссылка, Штрихкод)
	РегистрацияСостоянияЗаезда(Ссылка, Штрихкод);
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьПоставкуНаСклад(Ссылка, Штрихкод)
	Ошибка= Неопределено;

	Если ПолучитьСтатус(Ссылка) = ПредопределенноеЗначение("Перечисление.СтатусыПоставокНаСклад.Прибыл")  Тогда					
		РегистрацияСостоянияЗаезда(Ссылка, Штрихкод);
	ИначеЕсли ПолучитьСтатус(Ссылка) = ПредопределенноеЗначение("Перечисление.СтатусыПоставокНаСклад.Разгружается") Тогда
	Иначе
		Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.НеВерныйСтатусДокумента");
		ЗафиксироватьОшибку(Ссылка, Ошибка, Штрихкод);					
		РегистрацияСостоянияЗаезда(Ссылка, Штрихкод, Ошибка);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Функция ЗарегистрироватьСостояниеПоРейсу(Рейс, Штрихкод, ЭтоРейс=Ложь)
	мДокументовПродажи= УправлениеДоступомСервер.ПолучитьДокументыПродажиСервер(Рейс);
	
	Для Каждого Ссылка Из мДокументовПродажи Цикл	
		ОбработатьДокументНаВъездВыезд(Ссылка, Штрихкод, ЭтоРейс);
	КонецЦикла;
	
	УстановитьСтатусРейса(Рейс);
КонецФункции
&НаКлиенте
Процедура ОбработатьВозврат(Ссылка, Штрихкод)
	РегистрацияСостоянияЗаезда(Ссылка, Штрихкод);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаказКлиента(Ссылка, Штрихкод)
	мДокументовПродажи = УправлениеДоступомСервер.ПолучитьДокументыПродажиСервер(Ссылка); 
	Для Каждого Ссылка Из мДокументовПродажи Цикл	
		ОбработатьДокументНаВъездВыезд(Ссылка, Штрихкод);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьБлокировку(Ссылка, Штрихкод)
	РегистрацияСостоянияЗаезда(Ссылка, Штрихкод);
КонецПроцедуры	
	
&НаСервереБезКонтекста
Процедура УстановитьСтатусРейса(Ссылка)
	Рейс= Ссылка.ПолучитьОбъект();
	Если Ссылка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ДокументыНаПогрузкуГотовы") ИЛИ Ссылка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ВодительДокументыПолучил") Тогда
		Рейс.Статус= ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСНаПогрузке");
	ИначеЕсли Ссылка.Статус= ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСНаПогрузке") Тогда
		Рейс.Статус= ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСВПути");
	КонецЕсли;
	Рейс.Записать(РежимЗаписиДокумента.Проведение);
	
	АльтерраОбщегоНазначения.УстановитьСтатусВодителю(Рейс.Водитель, Перечисления.СтатусыВодителей.ВРейсе, "установлен из КПП",, Рейс.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЛюбойДругой(Ссылка, Штрихкод)
	Ошибка= ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.НеПредусмотренДляСканирования");
	ЗафиксироватьОшибку(Ссылка, Ошибка, Штрихкод);					
	
	РегистрацияСостоянияЗаезда(Ссылка, Штрихкод, Ошибка);
КонецПроцедуры

#КонецОбласти

#Область ЗаписьВРегистр
&НаСервереБезКонтекста
Функция МашинаНаСкладе(Ссылка)
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостояниеОтгрузкиДокументаСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних(, Документ = &Ссылка) КАК СостояниеОтгрузкиДокументаСрезПоследних
	|ГДЕ
	|	СостояниеОтгрузкиДокументаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Заехал)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаСервереБезКонтекста
Функция МашинаУжеВыезжала(Ссылка)
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостояниеОтгрузкиДокументаСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних(
	|			,
	|			Документ = &Ссылка
	|				И Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Выехал)) КАК СостояниеОтгрузкиДокументаСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция РегистрацияСостояния(Ссылка, Состояние, Штрихкод="", Ошибка)
	УстановитьПривилегированныйРежим(Истина);
	Результат = Истина;
	
	ДатаСобытия = ТекущаяДата();
	
	Запись = РегистрыСведений.СостояниеОтгрузкиДокумента.СоздатьМенеджерЗаписи();
	
	Запись.Документ			= Ссылка;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", Ссылка.Метаданные()) Тогда
		Запись.Филиал			= Ссылка.Подразделение;
	КонецЕсли;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.БлокировкаДвиженияТоваров") Тогда
		Запись.Филиал			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка.Склад,"Подразделение");
	КонецЕсли;
	Запись.Период				= ДатаСобытия;	
	Запись.Состояние		= ?(Состояние="Заезд", Перечисления.СостоянияОтгрузкиДокумента.Заехал, Перечисления.СостоянияОтгрузкиДокумента.Выехал);
	Запись.Штрихкод			= Штрихкод;
	Запись.Ошибка= Ошибка;
	Запись.НомерЗаезда = ПолучитьНомерЗаезда(Ссылка)+1;
	
	Попытка
		Запись.Записать(Ложь);
	Исключение
		Сообщить(ИнформацияОбОшибке().Описание);
		Результат = Ложь;	
	КонецПопытки;
		
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
КонецФункции
&НаСервереБезКонтекста
Функция РегистрацияСостоянияОшибка(Ссылка, Ошибка, Штрихкод="")
	УстановитьПривилегированныйРежим(Истина);
	Результат = Истина;
	
	ДатаСобытия = ТекущаяДата();
	
	Запись = РегистрыСведений.СостояниеОтгрузкиДокумента.СоздатьМенеджерЗаписи();
	Если ЗначениеЗаполнено(Ссылка) Тогда 
		Запись.Документ			= Ссылка;
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", Ссылка.Метаданные()) Тогда
			Запись.Филиал			= Ссылка.Подразделение;
		КонецЕсли;
	КонецЕсли;
	Запись.Период				= ДатаСобытия;	
	Запись.Состояние		= Перечисления.СостоянияОтгрузкиДокумента.Ошибка;
	Запись.Ошибка			= Ошибка;
	Запись.Штрихкод			= Штрихкод;
	
	Попытка
		Запись.Записать(Ложь);
	Исключение
		Результат = Ложь;	
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
	
КонецФункции
&НаСервереБезКонтекста
Функция ЗаписатьОтзывКлиента(Ссылка, ОценкаКлиента)
	УстановитьПривилегированныйРежим(Истина);
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостояниеОтгрузкиДокументаСрезПоследних.Период КАК Период,
	|	СостояниеОтгрузкиДокументаСрезПоследних.Документ,
	|	СостояниеОтгрузкиДокументаСрезПоследних.Филиал,
	|	СостояниеОтгрузкиДокументаСрезПоследних.Состояние,
	|	СостояниеОтгрузкиДокументаСрезПоследних.Ошибка,
	|	СостояниеОтгрузкиДокументаСрезПоследних.ОценкаКлиента
	|ИЗ
	|	РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних(
	|			,
	|			Документ = &Документ
	|				И Состояние = &Состояние
	|				И Филиал = &Филиал) КАК СостояниеОтгрузкиДокументаСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияОтгрузкиДокумента.Выехал);
	Запрос.УстановитьПараметр("Филиал", Ссылка.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() = 1 Тогда
		РСНЗСостояниеОтгрузкиДокумента = РегистрыСведений.СостояниеОтгрузкиДокумента.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(РСНЗСостояниеОтгрузкиДокумента, ТЗ[0]);
		РСНЗСостояниеОтгрузкиДокумента.Прочитать();
		Если РСНЗСостояниеОтгрузкиДокумента.Выбран() Тогда
			РСНЗСостояниеОтгрузкиДокумента.ОценкаКлиента= ОценкаКлиента;
			
			Попытка
				РСНЗСостояниеОтгрузкиДокумента.Записать();
			Исключение
				Результат = Ложь;	
			КонецПопытки;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
		Возврат Результат;
	КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьНомерЗаезда(Документ)

	МассивСтатусов = Новый Массив();
	МассивСтатусов.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Заехал);
	МассивСтатусов.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Выехал);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеОтгрузкиДокументаСрезПоследних.НомерЗаезда КАК НомерЗаезда
		|ИЗ
		|	РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних(
		|			&Период,
		|			Документ = &Документ
		|				И Состояние В (&МассивСтатусов)) КАК СостояниеОтгрузкиДокументаСрезПоследних";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерЗаезда;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции	
	
&НаКлиенте
Процедура РегистрацияСостоянияЗаезда(Ссылка, Штрихкод="", Ошибка=Неопределено)
	Если РегистрацияСостояния(Ссылка, "Заезд", Штрихкод, Ошибка) Тогда
		Если Не ЗначениеЗаполнено(Ошибка) Тогда
			Элементы.НадписьСообщения.ЦветТекста= СтрукЦветаСтиля.Зеленый;
			НадписьСообщения= "Машина заехала.";
			Картинка= АдрессРазрешено;
			ПроигратьЗвук("ok");
		КонецЕсли;
	Иначе
		ЗафиксироватьОшибку(Ссылка, ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ОшибкаРегистрацииЗаезда"), Штрихкод);					
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура РегистрацияСостоянияВыезда(Ссылка, Штрихкод="", Ошибка=Неопределено)
	Если ОшибочнаяРегистрацияНаВъезд(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Если РегистрацияСостояния(Ссылка, "Выезд", Штрихкод, Ошибка) Тогда
		Элементы.НадписьСообщения.ЦветТекста= СтрукЦветаСтиля.Синий;
		НадписьСообщения= "Машина выехала.";
		Картинка= АдрессРазрешено;
		ПроигратьЗвук("out");
		ПоследнийПросканированныйДокумент= Ссылка;
	Иначе
		ЗафиксироватьОшибку(Ссылка, ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ОшибкаРегистрацииВыезда"), Штрихкод);				
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура  ЗафиксироватьОшибку(Ссылка, Ошибка, Штрихкод="")
	Элементы.НадписьСообщения.ЦветТекста= СтрукЦветаСтиля.Красный;
	НадписьСообщения= Строка(Ошибка)+" ("+Штрихкод+")!";
	Картинка= АдрессЗапрещено;
	РегистрацияСостоянияОшибка(Ссылка, Ошибка, Штрихкод);
	ПроигратьЗвук("fail");
	Пауза(1);
КонецПроцедуры

#КонецОбласти

#Область РегистрацияСотрудников
&НаКлиенте
Процедура ЗарегистрироватьСотрудникаПоШтрихкоду(Штрихкод)
	Результат= ЗрегестрироватьСотрудникаПоШтрихкодуСервер(Штрихкод);
	
	Если Результат.Ошибка Тогда
		Картинка= АдрессЗапрещено;
		Элементы.НадписьСообщения.ЦветТекста= СтрукЦветаСтиля.Красный;
		НадписьСообщения= Результат.ТекстОшибки;
		ПроигратьЗвук("fail");
	Иначе
		Если Не ЗначениеЗаполнено(Картинка) Тогда
			Картинка= АдрессРазрешено;
		КонецЕсли;
		Если  Результат.Событие = ПредопределенноеЗначение("Перечисление.СостоянияСотрудников.Зашел") Тогда 
			Элементы.НадписьСообщения.ЦветТекста= СтрукЦветаСтиля.Зеленый;
			НадписьСообщения= "Сотрудник зашел!";
			ПроигратьЗвук("ok");
		Иначе
			Элементы.НадписьСообщения.ЦветТекста= СтрукЦветаСтиля.Синий;
			НадписьСообщения= "Сотрудник вышел!";
			ПроигратьЗвук("out");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗрегестрироватьСотрудникаПоШтрихкодуСервер(Штрихкод)
	Ошибка= Ложь;
	Сотрудник= Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
	Событие= Перечисления.СостоянияСотрудников.Вышел;
	
	Результат= АльтерраОбщегоНазначения.СотрудникВОфисе(Сотрудник);
	
	ПредыдущееСостояние= Результат.Состояние;
	ПериодПредудущегоСобытия= Результат.Период;
	
	//Проверяем двойное сканирование
	Если (ПериодПредудущегоСобытия+5*1) >= ТекущаяДата() Тогда
		Ошибка= Истина;
		Событие= ПредыдущееСостояние;
		Возврат  Новый Структура("Событие, Ошибка,ТекстОшибки", Событие, Ошибка, "Между последним сконированием прошло меньше 5 минут!");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		НадписьСотрудник= Сотрудник.Наименование+", "+Сотрудник.Должность;
		Элементы.НадписьСотрудник.Видимость= Истина;
		Если Сотрудник.Уволен Или Сотрудник.ПометкаУдаления Тогда
			Возврат Новый Структура("Событие,Ошибка,ТекстОшибки", Неопределено, Истина, "Сотрудник уволен!");
		Иначе
			НаборЗаписей= РегистрыСведений.УчетРабочегоВремениСотрудников.СоздатьНаборЗаписей();
			НоваяЗапись= НаборЗаписей.Добавить();
			НоваяЗапись.Период= ТекущаяДата();
			НоваяЗапись.Сотрудник= Сотрудник;
			НоваяЗапись.Пользователь= Сотрудник.Пользователь;
			НоваяЗапись.Подразделение= ?(ЗначениеЗаполнено(Сотрудник.Подразделение), Сотрудник.Подразделение, Сотрудник.Пользователь.ТекущееПодразделение);
			
			Если НачалоДня(ПериодПредудущегоСобытия) < НачалоДня(ТекущаяДата()) Тогда
				НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
			Иначе
				// Общая проверка
				Если  ПредыдущееСостояние = Перечисления.СостоянияСотрудников.Вышел Тогда//Вышел или ещё не было
					НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
				Иначе
					НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Вышел;
				КонецЕсли;
			КонецЕсли;
			Событие= НоваяЗапись.Событие;
			
			НаборЗаписей.Записать(Ложь);
			
			ДанныеФотографии= Сотрудник.Фотография.Получить();
			Если ЗначениеЗаполнено(ДанныеФотографии) Тогда
				Картинка= ПоместитьВоВременноеХранилище(ДанныеФотографии);
			Иначе
				Картинка= Неопределено;
			КонецЕсли;
		КонецЕсли;
	Иначе 
		Ошибка= Истина;
		Возврат  Новый Структура("Событие,Ошибка,ТекстОшибки", Событие, Истина, "Сотрудник не найден!");
	КонецЕсли;
	
	Возврат  Новый Структура("Событие,Ошибка,ТекстОшибки", Событие, Ошибка, "");
КонецФункции
#КонецОбласти

#Область ФункцииРаботыСоЗвуком
&НаКлиенте
Процедура ПроигратьЗвук(Звук)
	Попытка
		ДанныеЗвука= ПолучитьМакет(Звук);
		ИмяВременногоФайла = КаталогВременныхФайлов() + Звук + ".wav";
		ДанныеЗвука.Записать(ИмяВременногоФайла);	
		oVoice = Новый COMObject("SAPI.SpVoice");
		oSpFileStream = Новый COMObject("SAPI.SpFileStream");
		oSpFileStream.Open(ИмяВременногоФайла);
		oVoice.SpeakStream(oSpFileStream);
		oSpFileStream.Close();
	Исключение
		Сообщить("Ошибка: "+ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакет(Звук)
	ОбъектО = РеквизитФормыВЗначение("Объект");
	ДанныеЗвука = ОбъектО.ПолучитьМакет(Звук);
	Возврат ДанныеЗвука;
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункции
//ПРОВЕРКИ
&НаСервереБезКонтекста
Функция ДокументПроведен(Ссылка)
	Возврат Ссылка.Проведен;
КонецФункции

&НаСервереБезКонтекста
Функция ДокументОплачен(Ссылка)
	Возврат Ссылка.Проведен И Не Ссылка.Кассир.Пустая();
КонецФункции
&НаСервереБезКонтекста
Функция ЧекПробит(Ссылка)
	Возврат Ссылка.Статус = Перечисления.СтатусыЧековККМ.Пробит;
КонецФункции

&НаСервереБезКонтекста
Функция ДокументОтгружен(Ссылка)
	флДокументОтгружен = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Кладовщик = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМТовары.Ссылка
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|ГДЕ
	|	ЧекККМТовары.Кладовщик = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ЧекККМТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		флДокументОтгружен = Ложь;
	КонецЕсли;
	
	Возврат флДокументОтгружен;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРейс(Ссылка)
	Рейс= Документы.ЗаданиеНаПеревозкуРейс.ПолучитьРейсПоДокументуПродажи(Ссылка);
	Если ЗначениеЗаполнено(Рейс) Тогда
		Возврат Рейс;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
&НаКлиенте
Процедура НачальноеСостониеФормы()
	//
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦвета()
	Возврат Новый Структура("Зеленый,Синий,Красный", ЦветаСтиля.ГруппаВариантовОтчетовЦвет, ЦветаСтиля.ИзмененноеЗначениеРеквизитаЦвет,ЦветаСтиля.ЦветОтрицательногоЧисла);
КонецФункции

&НаСервере
Функция ЭтоОшибочноеСканирование(Ссылка)
	ТекущееВремя= ТекущаяДата();
	Если Ссылка = ПредыдущийДокумент Тогда
		Если ТекущееВремя-ВремяПоследнегоСканирования  <= 60 Тогда
			ПредыдущийДокумент= Ссылка;
			Возврат Истина;
		Иначе
			ВремяПоследнегоСканирования=  ТекущееВремя;
			ПредыдущийДокумент= Ссылка;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	ПредыдущийДокумент= Ссылка;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЧекККМ.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ВозвратТоваровОтКлиента.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЧекККМВозврат.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказПоставщику.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПеремещениеТоваров.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаданиеНаПеревозкуРейс.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказНаДоставкуКлиенту.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.БлокировкаДвиженияТоваров.ПустаяСсылка")); 
	
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатус(Ссылка)
	Возврат Ссылка.Статус;
КонецФункции

&НаКлиенте
Процедура Пауза(Время)
	ВремяЗавершения = ТекущаяДата() + Время;
	Пока ТекущаяДата() < ВремяЗавершения Цикл
	КонецЦикла;
КонецПроцедуры

Функция ОшибочнаяРегистрацияНаВъезд(Документ)
	
	ТекущееВремя = ТекущаяДата();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеОтгрузкиДокументаСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних(
		|			&Период,
		|			Документ = &Документ
		|				И Состояние = &Статус) КАК СостояниеОтгрузкиДокументаСрезПоследних";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Период", ТекущееВремя);
	Запрос.УстановитьПараметр("Статус", Перечисления.СостоянияОтгрузкиДокумента.Заехал);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ?(ТекущееВремя - ВыборкаДетальныеЗаписи.Период <= 30,Истина,Ложь);
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#КонецОбласти
